[
  {
    "name": "Ross",
    "alt": "Ross K's Testimony",
    "score": 5.0,
    "testimony": "I’ve been learning Swedish consistently with Tea for over a year, taking 2 lessons each week. Tea has an excellent knowledge of many topics and is a great teacher, my understanding of the Swedish language has increased a great deal thanks to our lessons (still a long way to go!). My learning has been motivated by a mix of professional reasons and a longstanding wish to learn a 2nd language. I’m really grateful for finding Tea via Tutorful and would definitely recommend for Swedish (and I’m sure all other subjects she teaches)."
  },
  {
    "name": "Joshua",
    "alt": "Joshua G's Testimony",
    "score": 5.0,
    "testimony": "Tea is a sweetheart. She knows her stuff inside and out. Swedish is a big challenge for me but I trust in time (if she can bear it ;) ) I will pick it up! Recommend for sure."
  },
  {
    "name": "Richard",
    "alt": "Richard W's Testimony",
    "score": 5.0,
    "testimony": "Our 15-year-old daughter has been having Swedish lessons with Tea for almost 4 months. It’s been brilliant. Tea is friendly, kind, encouraging and keeps the learning fresh and challenging. Above all, she is really engaging and intuitive. We feel lucky to have found her and would recommend her to anyone, whatever their reasons for learning Swedish."
  },
  {
    "name": "Nancy",
    "alt": "Nancy J's Testimony",
    "score": 5.0,
    "testimony": "Tea has been teaching my son Swedish. Only a few lessons so far, but we will definitely continue. Tea has been well-organized and helpful, and the lessons are great."
  },
  {
    "name": "Sonja",
    "alt": "Sonja R's Testimony",
    "score": 5.0,
    "testimony": "Tea has made learning a language really fun and fulfilling. She's very patient, encouraging, and most importantly makes you feel comfortable during the whole language learning process. I look forward to her lessons every week!"
  },
  {
    "name": "Joy",
    "alt": "Joy H's Testimony",
    "score": 5.0,
    "testimony": "Tea was very encouraging."
  },
  {
    "name": "Alice",
    "alt": "Alice B's Testimony",
    "score": 5.0,
    "testimony": "Tea has provided me with some very challenging work that I really appreciate as it’s pushing me to develop my understanding of the Swedish language. She is very patient and takes time to explain and clarify when I don’t understand something. Sometimes I feel awkward speaking to friends or family in Swedish, but Tea makes it very easy to communicate and doesn’t make me feel awkward, even when I stumble over the words!"
  },
  {
    "name": "Filomea",
    "alt": "Filomea S's Testimony",
    "score": 5.0,
    "testimony": "Very good."
  },
  {
    "name": "Mihir",
    "alt": "Mihir M's Testimony",
    "score": 5.0,
    "testimony": "She is brilliant!! My kid is enjoying every minute of the class. I would definitely recommend her."
  },
  {
    "name": "Julie W",
    "alt": "Julie W's Testimony",
    "score": 5.0,
    "testimony": "My daughter is getting a lot out of her sessions with Tea, KS3 English and Maths; she finds her helpful and is great at explaining."
  },
  {
    "name": "Julie J",
    "alt": "Julie J's Testimony",
    "score": 5.0,
    "testimony": "Tea is simply fantastic! All lessons are effortlessly delivered and well prepared. Her breadth of knowledge allows her to easily support my children across two stages (KS1 & KS3). I highly recommend Tea as a tutor."
  },
  {
    "name": "Linda",
    "alt": "Linda O's Testimony",
    "score": 5.0,
    "testimony": "My daughter just had her first lesson and found it really helpful. Tea was lovely and explained everything really well."
  },
  {
    "name": "Richard",
    "alt": "Richard H's Testimony",
    "score": 5.0,
    "testimony": "Tea is great with my son. She is very patient with him and allows him to work things out for himself. We would highly recommend her as an online tutor."
  },
  {
    "name": "Cristina",
    "alt": "Cristina I's Testimony",
    "score": 5.0,
    "testimony": "Tea was quick at assessing the needs of my niece and in developing an action plan. She's great at explaining and a very joyful presence. I fully recommend her."
  },
  {
    "name": "William",
    "alt": "William's Testimony",
    "score": 5.0,
    "testimony": "Time flies when you're having fun and thankfully I'm learning too! Tea has been a huge help during lessons and helped me structure my independent learning. Her positive attitude is always a nice way to start my day. I'm looking forward to many more lessons in the future!"
  },
  {
    "name": "Katja",
    "alt": "Katja's Testimony",
    "score": 5.0,
    "testimony": "We're super happy with Tea so far! She's been giving Swedish lessons to our nine-year-old and she's great at balancing fun and rigor with him. Highly recommend Tea!"
  },
  {
    "name": "Silvia",
    "alt": "Silvia's Testimony",
    "score": 5.0,
    "testimony": "I'm super happy I found Tea. She can make the class specific for you. Always willing to teach! Super recommend her."
  },
  {
    "name": "Tyler",
    "alt": "Tyler's Testimony",
    "score": 5.0,
    "testimony": "Tea is super smart and really knows her stuff and she is super accommodating and works with you at your level and pace. I would highly recommend Tea to anyone looking to learn a new language. You will not be disappointed!"
  },
  {
    "name": "Charlotte",
    "alt": "Charlotte's Testimony",
    "score": 5.0,
    "testimony": "Tea has been tutoring my daughter for a year and has been absolutely amazing. She’s kept me updated after every lesson and catered to her abilities. Tea has shown a high level of creativity and innovation in modifying lessons to suit her needs. An hour is a long time to keep her engaged and Tea did it from a computer 2-3 times a week for a year. Tea is a rockstar and I truly believe that she can teach anybody anything."
  },
  {
    "name": "Craige",
    "alt": "Craige's Testimony",
    "score": 5.0,
    "testimony": "First Lesson with Tea! I'm from Newcastle so my accent does not work very well with learning haha. But Tea helped me through it. Funny class and very patient with me. Relaxed within 5 minutes (I have anxiety also). Amazing time! Highly recommend."
  },
  {
    "name": "Anna",
    "alt": "Anna's Testimony",
    "score": 5.0,
    "testimony": "Tea is an extremely qualified Swedish teacher and was very patient and tuned in to my level of ability. She can instantly give you the right word, phrase or sentence that actual Swedes would use and tailored her teaching style to meet my language goals. I’m now confident enough to contribute to a range of conversation topics with my partner and his family. Tack så mycket!!"
  }
]