[
  {
    "position": "Private Educator",
    "start_date": "09/2017",
    "end_date": "Current",
    "responsibilities": [
      "Supported over 70 students ages five to 60, including students with cognitive disabilities, behavioural difficulties, and from various socio-economic backgrounds, covering Mathematics (A-level), English (A-level), Science (GCSE), and Swedish (Business/C1).",
      "Proofread, edited, and translated (English to Swedish) complex technical documents, such as material for shareholder meetings, press releases, M&A documents, and other key communications.",
      "Guided a businessman to proficiency in Swedish, enabling him to conduct meetings confidently in the language after a year of lessons.",
      "Supported a student at risk of failing Mathematics (Nat4) to achieve their goal of studying Mathematics at university, resulting in acceptance to Birmingham in 2021.",
      "Elevated a student from the lower middle set in Mathematics to the top set, building confidence and competency.",
      "Assisted a student in moving from the second lowest set to the highest set in English over three terms.",
      "Prepared a student for Higher Mathematics GCSE, integrating first-year university linear algebra into the curriculum.",
      "Enabled several students to progress from no knowledge of Swedish to confidently working at a B2 level."
    ]
  },
  {
    "position": "Language Assessor",
    "company": "TLS",
    "start_date": "08/2021",
    "end_date": "08/2023",
    "responsibilities": [
      "Conducted oral and written language assessments according to the MOD and FCDO standards."
    ]
  },
  {
    "position": "Primary Teacher",
    "company": "West Lothian Council",
    "start_date": "08/2020",
    "end_date": "08/2021",
    "responsibilities": [
      "Adapted teaching methods and materials to meet the needs and interests of a class of more than 30 students, requiring constant critical evaluation of my own teaching to make improvements.",
      "Assessed, recorded and reported on child development, progress, and attainment to encourage continuous improvement against educational goals.",
      "Collaborated with colleagues to review data and develop instructional strategies to address student learning objectives."
    ]
  },
  {
    "position": "Receptionist",
    "company": "Stockholm Kickboxing",
    "start_date": "12/2015",
    "end_date": "06/2016",
    "responsibilities": [
      "Solved administrative and customer service issues with knowledgeable assistance and friendly support."
    ]
  },
  {
    "position": "Sales Assistant",
    "company": "Flying Tiger of Copenhagen",
    "start_date": "01/2015",
    "end_date": "06/2016",
    "responsibilities": [
      "Worked tirelessly to maintain efficient operations during peak trading hours, providing service with a smile, and offering courteous, helpful advice to meet customer needs."
    ]
  }
]